{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.2", "config": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "activation": "relu", "batch_input_shape": [null, 28, 28, 1], "trainable": true, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_1", "dtype": "float32", "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "filters": 32}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "activation": "relu", "trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_2", "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "filters": 32}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_1", "rate": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "relu", "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "units": 128, "name": "dense_1", "kernel_constraint": null, "use_bias": true, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_2", "rate": 0.5}}, {"class_name": "Dense", "config": {"activation": "softmax", "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "units": 10, "name": "dense_2", "kernel_constraint": null, "use_bias": true, "bias_constraint": null}}]}