{"backend": "tensorflow", "config": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "bias_regularizer": null, "padding": "valid", "batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "name": "conv2d_1", "filters": 32}, "class_name": "Conv2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": true, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "name": "conv2d_2", "filters": 32}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.25, "seed": null, "noise_shape": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "units": 128, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.5, "seed": null, "noise_shape": null, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "units": 10, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "activation": "softmax", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_2"}, "class_name": "Dense"}], "keras_version": "2.1.2", "class_name": "Sequential"}